{"class_name": "Sequential", "keras_version": "2.0.6", "config": [{"class_name": "Conv2D", "config": {"activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "relu", "bias_constraint": null, "dtype": "float32", "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "name": "conv2d_1", "trainable": true, "batch_input_shape": [null, 512, 512, 3], "strides": [1, 1], "use_bias": true, "padding": "valid"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "trainable": true, "strides": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "name": "conv2d_2", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_size": [3, 3], "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "strides": [1, 1], "use_bias": true, "padding": "valid"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2", "trainable": true, "strides": [2, 2], "padding": "valid"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.25}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "name": "conv2d_3", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_size": [3, 3], "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "strides": [1, 1], "use_bias": true, "padding": "valid"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_3", "trainable": true, "strides": [2, 2], "padding": "valid"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.25}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "name": "conv2d_4", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_size": [3, 3], "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "strides": [1, 1], "use_bias": true, "padding": "valid"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_4", "trainable": true, "strides": [2, 2], "padding": "valid"}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "rate": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "units": 128, "kernel_constraint": null, "bias_regularizer": null, "name": "dense_1", "activity_regularizer": null, "use_bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "rate": 0.25}}, {"class_name": "Dense", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "units": 128, "kernel_constraint": null, "bias_regularizer": null, "name": "dense_2", "activity_regularizer": null, "use_bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "rate": 0.25}}, {"class_name": "Dense", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "units": 128, "kernel_constraint": null, "bias_regularizer": null, "name": "dense_3", "activity_regularizer": null, "use_bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_6", "trainable": true, "rate": 0.25}}, {"class_name": "Dense", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "softmax", "bias_constraint": null, "kernel_regularizer": null, "units": 4, "kernel_constraint": null, "bias_regularizer": null, "name": "dense_4", "activity_regularizer": null, "use_bias": true}}], "backend": "tensorflow"}